Plan the new module:

```
$ terraform plan -out franklin.out
Refreshing Terraform state in-memory prior to plan...
The refreshed state will be used to calculate this plan, but will not be
persisted to local or remote state storage.

data.aws_vpc.default: Refreshing state...
aws_key_pair.deployer: Refreshing state... [id=deployer-key]
data.aws_subnet_ids.all: Refreshing state...
module.security_group.aws_security_group.this_name_prefix[0]: Refreshing state... [id=sg-0e4b1fb13c57fffcc]
module.security_group.aws_security_group_rule.ingress_rules[1]: Refreshing state... [id=sgrule-2981393778]
module.security_group.aws_security_group_rule.ingress_rules[2]: Refreshing state... [id=sgrule-1927495565]
module.security_group.aws_security_group_rule.ingress_rules[0]: Refreshing state... [id=sgrule-121514183]
module.security_group.aws_security_group_rule.egress_rules[0]: Refreshing state... [id=sgrule-1668044462]
module.security_group.aws_security_group_rule.ingress_with_cidr_blocks[0]: Refreshing state... [id=sgrule-3274026523]
aws_network_interface.this[0]: Refreshing state... [id=eni-0d05f501148a37c97]
module.ec2.aws_instance.this[0]: Refreshing state... [id=i-07a4c4b83e93b7ad4]

------------------------------------------------------------------------

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.gibson.module.ec2.aws_instance.this[0] will be created
  + resource "aws_instance" "this" {
      + ami                          = "ami-0a35dcc4aa0574b59"
      + arn                          = (known after apply)
      + associate_public_ip_address  = true
      + availability_zone            = (known after apply)
      + cpu_core_count               = (known after apply)
      + cpu_threads_per_core         = (known after apply)
      + disable_api_termination      = false
      + ebs_optimized                = false
      + get_password_data            = false
      + host_id                      = (known after apply)
      + id                           = (known after apply)
      + instance_state               = (known after apply)
      + instance_type                = "t2.micro"
      + ipv6_address_count           = (known after apply)
      + ipv6_addresses               = (known after apply)
      + key_name                     = (known after apply)
      + monitoring                   = false
      + outpost_arn                  = (known after apply)
      + password_data                = (known after apply)
      + placement_group              = (known after apply)
      + primary_network_interface_id = (known after apply)
      + private_dns                  = (known after apply)
      + private_ip                   = (known after apply)
      + public_dns                   = (known after apply)
      + public_ip                    = (known after apply)
      + secondary_private_ips        = (known after apply)
      + security_groups              = (known after apply)
      + source_dest_check            = true
      + subnet_id                    = "subnet-0b334447"
      + tags                         = {
          + "Environment" = "SecOps-CTF"
          + "Name"        = "Gibson"
          + "Terraform"   = "true"
        }
      + tenancy                      = "default"
      + volume_tags                  = {
          + "Name" = "SecOps_CTF_Gibson"
        }
      + vpc_security_group_ids       = [
          + "sg-0e4b1fb13c57fffcc",
        ]

      + credit_specification {
          + cpu_credits = "standard"
        }

      + ebs_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + snapshot_id           = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }

      + ephemeral_block_device {
          + device_name  = (known after apply)
          + no_device    = (known after apply)
          + virtual_name = (known after apply)
        }

      + metadata_options {
          + http_endpoint               = (known after apply)
          + http_put_response_hop_limit = (known after apply)
          + http_tokens                 = (known after apply)
        }

      + network_interface {
          + delete_on_termination = (known after apply)
          + device_index          = (known after apply)
          + network_interface_id  = (known after apply)
        }

      + root_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.

------------------------------------------------------------------------

This plan was saved to: franklin.out

To perform exactly these actions, run the following command to apply:
    terraform apply "franklin.out"
```